MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_rtc.h
/* RTC_DBGCTL Bits */
/* RTC_DBGCTL[DBGRUN] Bits */
#define RTC_DBGCTL_DBGRUN_OFS                    (0)                             /* !< DBGRUN Offset */
#define RTC_DBGCTL_DBGRUN_MASK                   ((uint32_t)0x00000001U)         /* !< Debug Run. */
#define RTC_DBGCTL_DBGRUN_HALT                   ((uint32_t)0x00000000U)         /* !< Counter is halted if CPU is in
                                                                                    debug state. */
#define RTC_DBGCTL_DBGRUN_RUN                    ((uint32_t)0x00000001U)         /* !< Continue to operate normally
                                                                                    ignoring the debug state of the CPU. */
/* RTC_DBGCTL[DBGINT] Bits */
#define RTC_DBGCTL_DBGINT_OFS                    (1)                             /* !< DBGINT Offset */
#define RTC_DBGCTL_DBGINT_MASK                   ((uint32_t)0x00000002U)         /* !< Debug Interrupt Enable. */
#define RTC_DBGCTL_DBGINT_OFF                    ((uint32_t)0x00000000U)         /* !< Interrupts of the module will not
                                                                                    be captured anymore if CPU is in
                                                                                    debug state. Which means no up2025-10-01 to
                                                                                    the RTCRIS, RTCMISC and RTCIIDX
                                                                                    register. */
#define RTC_DBGCTL_DBGINT_ON                     ((uint32_t)0x00000002U)         /* !< Interrupts are enabled in debug
                                                                                    mode. Interrupt requests are signaled
                                                                                    to the interrupt controller. If the
                                                                                    flags are required by software
                                                                                    (polling mode) the DGBINT bit need to
                                                                                    be set to 1. */

/* RTC_CTL Bits */
/* RTC_CTL[RTCTEVTX] Bits */
#define RTC_CTL_RTCTEVTX_OFS                     (0)                             /* !< RTCTEVTX Offset */
#define RTC_CTL_RTCTEVTX_MASK                    ((uint32_t)0x00000003U)         /* !< Real-time clock time event. */
#define RTC_CTL_RTCTEVTX_MINUTE                  ((uint32_t)0x00000000U)         /* !< Minute changed. */
#define RTC_CTL_RTCTEVTX_HOUR                    ((uint32_t)0x00000001U)         /* !< Hour changed. */
#define RTC_CTL_RTCTEVTX_MIDNIGHT                ((uint32_t)0x00000002U)         /* !< Every day at midnight (00:00). */
#define RTC_CTL_RTCTEVTX_NOON                    ((uint32_t)0x00000003U)         /* !< Every day at noon (12:00). */
/* RTC_CTL[RTCBCD] Bits */
#define RTC_CTL_RTCBCD_OFS                       (7)                             /* !< RTCBCD Offset */
#define RTC_CTL_RTCBCD_MASK                      ((uint32_t)0x00000080U)         /* !< Real-time clock BCD select. Selects
                                                                                    BCD counting for real-time clock. */
#define RTC_CTL_RTCBCD_BINARY                    ((uint32_t)0x00000000U)         /* !< Binary code selected */
#define RTC_CTL_RTCBCD_BCD                       ((uint32_t)0x00000080U)         /* !< Binary coded decimal (BCD) code
                                                                                    selected */

/* RTC_STA Bits */
/* RTC_STA[RTCRDY] Bits */
#define RTC_STA_RTCRDY_OFS                       (0)                             /* !< RTCRDY Offset */
#define RTC_STA_RTCRDY_MASK                      ((uint32_t)0x00000001U)         /* !< Real-time clock ready. This bit
                                                                                    indicates when the real-time clock
                                                                                    time values are safe for reading. */
#define RTC_STA_RTCRDY_NOT_READY                 ((uint32_t)0x00000000U)         /* !< RTC time values in transition */
#define RTC_STA_RTCRDY_READY                     ((uint32_t)0x00000001U)         /* !< RTC time values safe for reading */
/* RTC_STA[RTCTCRDY] Bits */
#define RTC_STA_RTCTCRDY_OFS                     (1)                             /* !< RTCTCRDY Offset */
#define RTC_STA_RTCTCRDY_MASK                    ((uint32_t)0x00000002U)         /* !< Real-time clock temperature
                                                                                    compensation ready. This is a read
                                                                                    only bit that indicates when the
                                                                                    RTCTCMPx can be written. Write to
                                                                                    RTCTCMPx should be avoided when
                                                                                    RTCTCRDY is reset. */
#define RTC_STA_RTCTCRDY_NOT_READY               ((uint32_t)0x00000000U)         /* !< Real-time clock temperature
                                                                                    compensation not ready */
#define RTC_STA_RTCTCRDY_READY                   ((uint32_t)0x00000002U)         /* !< Real-time clock temperature
                                                                                    compensation ready */
/* RTC_STA[RTCTCOK] Bits */
#define RTC_STA_RTCTCOK_OFS                      (2)                             /* !< RTCTCOK Offset */
#define RTC_STA_RTCTCOK_MASK                     ((uint32_t)0x00000004U)         /* !< Real-time clock temperature
                                                                                    compensation write OK. This is a
                                                                                    read-only bit that indicates if the
                                                                                    write to RTCTCMP is successful or
                                                                                    not. */
#define RTC_STA_RTCTCOK_NOT_OK                   ((uint32_t)0x00000000U)         /* !< Write to RTCTCMPx is unsuccessful */
#define RTC_STA_RTCTCOK_OK                       ((uint32_t)0x00000004U)         /* !< Write to RTCTCMPx is successful */

/* RTC_CAL Bits */
/* RTC_CAL[RTCOCALX] Bits */
#define RTC_CAL_RTCOCALX_OFS                     (0)                             /* !< RTCOCALX Offset */
#define RTC_CAL_RTCOCALX_MASK                    ((uint32_t)0x000000FFU)         /* !< Real-time clock offset error
                                                                                    calibration. Each LSB represents
                                                                                    approximately +1ppm (RTCOCALXS = 1)
                                                                                    or -1ppm (RTCOCALXS = 0) adjustment
                                                                                    in frequency. Maximum effective
                                                                                    calibration value is +/-240ppm.
                                                                                    Excess values written above +/-240ppm
                                                                                    will be ignored by hardware. */
#define RTC_CAL_RTCOCALX_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Minimum effective calibration
                                                                                    value. */
#define RTC_CAL_RTCOCALX_MAXIMUM                 ((uint32_t)0x000000FFU)         /* !< Maximum effective calibration value
                                                                                    is +/-240ppm. Excess values written
                                                                                    above +/-240ppm will be ignored by
                                                                                    hardware. */
/* RTC_CAL[RTCOCALS] Bits */
#define RTC_CAL_RTCOCALS_OFS                     (15)                            /* !< RTCOCALS Offset */
#define RTC_CAL_RTCOCALS_MASK                    ((uint32_t)0x00008000U)         /* !< Real-time clock offset error
                                                                                    calibration sign. This bit decides
                                                                                    the sign of offset error calibration. */
#define RTC_CAL_RTCOCALS_DOWN                    ((uint32_t)0x00000000U)         /* !< Down calibration. Frequency
                                                                                    adjusted down. */
#define RTC_CAL_RTCOCALS_UP                      ((uint32_t)0x00008000U)         /* !< Up calibration. Frequency adjusted
                                                                                    up. */
/* RTC_CAL[RTCCALFX] Bits */
#define RTC_CAL_RTCCALFX_OFS                     (16)                            /* !< RTCCALFX Offset */
#define RTC_CAL_RTCCALFX_MASK                    ((uint32_t)0x00030000U)         /* !< Real-time clock calibration
                                                                                    frequency. Selects frequency output
                                                                                    to RTC_OUT pin for calibration
                                                                                    measurement. The corresponding port
                                                                                    must be configured for the peripheral
                                                                                    module function. */
#define RTC_CAL_RTCCALFX_OFF                     ((uint32_t)0x00000000U)         /* !< No frequency output to RTC_OUT pin
                                                                                    (MSPM0L1x0x, MSPM0G1x0x, MSPM0G3x0x
                                                                                    only) */
#define RTC_CAL_RTCCALFX_F32KHZ                  ((uint32_t)0x00000000U)         /* !< F32KHz */
#define RTC_CAL_RTCCALFX_F512HZ                  ((uint32_t)0x00010000U)         /* !< 512 Hz */
#define RTC_CAL_RTCCALFX_F256HZ                  ((uint32_t)0x00020000U)         /* !< 256 Hz */
#define RTC_CAL_RTCCALFX_F1HZ                    ((uint32_t)0x00030000U)         /* !< 1 Hz */

/* RTC_TCMP Bits */
/* RTC_TCMP[RTCTCMPX] Bits */
#define RTC_TCMP_RTCTCMPX_OFS                    (0)                             /* !< RTCTCMPX Offset */
#define RTC_TCMP_RTCTCMPX_MASK                   ((uint32_t)0x000000FFU)         /* !< Real-time clock temperature
                                                                                    compensation. Value written into this
                                                                                    register is used for temperature
                                                                                    compensation of RTC. Each LSB
                                                                                    represents approximately +1ppm
                                                                                    (RTCTCMPS = 1) or -1ppm (RTCTCMPS =
                                                                                    0) adjustment in frequency. Maximum
                                                                                    effective calibration value is
                                                                                    +/-240ppm. Excess values written
                                                                                    above +/-240ppm are ignored by
                                                                                    hardware. Reading from RTCTCMP
                                                                                    register at any time returns the
                                                                                    cumulative value which is the signed
                                                                                    addition of RTCOCALx and RTCTCMPX
                                                                                    values, and the up2025-10-01d sign bit
                                                                                    (RTCTCMPS) of the addition result. */
#define RTC_TCMP_RTCTCMPX_MINIMUM                ((uint32_t)0x00000000U)         /* !< Minimum value */
#define RTC_TCMP_RTCTCMPX_MAXIMUM                ((uint32_t)0x000000FFU)         /* !< Maximum value */
/* RTC_TCMP[RTCTCMPS] Bits */
#define RTC_TCMP_RTCTCMPS_OFS                    (15)                            /* !< RTCTCMPS Offset */
#define RTC_TCMP_RTCTCMPS_MASK                   ((uint32_t)0x00008000U)         /* !< Real-time clock temperature
                                                                                    compensation sign. This bit decides
                                                                                    the sign of temperature compensation. */
#define RTC_TCMP_RTCTCMPS_DOWN                   ((uint32_t)0x00000000U)         /* !< Down calibration. Frequency
                                                                                    adjusted down. */
#define RTC_TCMP_RTCTCMPS_UP                     ((uint32_t)0x00008000U)         /* !< Up calibration. Frequency adjusted
                                                                                    up. */

/* RTC_SEC Bits */
/* RTC_SEC[SECBIN] Bits */
#define RTC_SEC_SECBIN_OFS                       (0)                             /* !< SECBIN Offset */
#define RTC_SEC_SECBIN_MASK                      ((uint32_t)0x0000003FU)         /* !< Seconds Binary (0 to 59). If
                                                                                    RTCBCD=1 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define RTC_SEC_SECBIN_MINIMUM                   ((uint32_t)0x00000000U)         /* !< Minimum value */
#define RTC_SEC_SECBIN_MAXIMUM                   ((uint32_t)0x0000003BU)         /* !< Maximum value */
/* RTC_SEC[SECLOWBCD] Bits */
#define RTC_SEC_SECLOWBCD_OFS                    (8)                             /* !< SECLOWBCD Offset */
#define RTC_SEC_SECLOWBCD_MASK                   ((uint32_t)0x00000F00U)         /* !< Seconds BCD  low digit (0 to 9). If
                                                                                    RTCBCD=0 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define RTC_SEC_SECLOWBCD_MINIMUM                ((uint32_t)0x00000000U)         /* !< Minimum value */
#define RTC_SEC_SECLOWBCD_MAXIMUM                ((uint32_t)0x00000900U)         /* !< Maximum value */
/* RTC_SEC[SECHIGHBCD] Bits */
#define RTC_SEC_SECHIGHBCD_OFS                   (12)                            /* !< SECHIGHBCD Offset */
#define RTC_SEC_SECHIGHBCD_MASK                  ((uint32_t)0x00007000U)         /* !< Seconds BCD  high digit (0 to 5).
                                                                                    If RTCBCD=0 write to these bits will
                                                                                    be ignored and read give the value 0. */
#define RTC_SEC_SECHIGHBCD_MINIMUM               ((uint32_t)0x00000000U)         /* !< Minimum value */
#define RTC_SEC_SECHIGHBCD_MAXIMUM               ((uint32_t)0x00005000U)         /* !< Maximum value */

/* RTC_MIN Bits */
/* RTC_MIN[MINBIN] Bits */
#define RTC_MIN_MINBIN_OFS                       (0)                             /* !< MINBIN Offset */
#define RTC_MIN_MINBIN_MASK                      ((uint32_t)0x0000003FU)         /* !< Minutes Binary (0 to 59). If
                                                                                    RTCBCD=1 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define RTC_MIN_MINBIN_MINIMUM                   ((uint32_t)0x00000000U)         /* !< Minimum value */
#define RTC_MIN_MINBIN_MAXIMUM                   ((uint32_t)0x0000003BU)         /* !< Maximum value */
/* RTC_MIN[MINLOWBCD] Bits */
#define RTC_MIN_MINLOWBCD_OFS                    (8)                             /* !< MINLOWBCD Offset */
#define RTC_MIN_MINLOWBCD_MASK                   ((uint32_t)0x00000F00U)         /* !< Minutes BCD  low digit (0 to 9). If
                                                                                    RTCBCD=0 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define RTC_MIN_MINLOWBCD_MINIMUM                ((uint32_t)0x00000000U)         /* !< Minimum value */
#define RTC_MIN_MINLOWBCD_MAXIMUM                ((uint32_t)0x00000900U)         /* !< Maximum value */
/* RTC_MIN[MINHIGHBCD] Bits */
#define RTC_MIN_MINHIGHBCD_OFS                   (12)                            /* !< MINHIGHBCD Offset */
#define RTC_MIN_MINHIGHBCD_MASK                  ((uint32_t)0x00007000U)         /* !< Minutes BCD  high digit (0 to 5).
                                                                                    If RTCBCD=0 write to these bits will
                                                                                    be ignored and read give the value 0. */
#define RTC_MIN_MINHIGHBCD_MINIMUM               ((uint32_t)0x00000000U)         /* !< Minimum value */
#define RTC_MIN_MINHIGHBCD_MAXIMUM               ((uint32_t)0x00005000U)         /* !< Maximum value */

/* RTC_HOUR Bits */
/* RTC_HOUR[HOURBIN] Bits */
#define RTC_HOUR_HOURBIN_OFS                     (0)                             /* !< HOURBIN Offset */
#define RTC_HOUR_HOURBIN_MASK                    ((uint32_t)0x0000001FU)         /* !< Hours Binary (0 to 23). If RTCBCD=1
                                                                                    write to these bits will be ignored
                                                                                    and read give the value 0. */
#define RTC_HOUR_HOURBIN_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Minimum value. */
#define RTC_HOUR_HOURBIN_MAXIMUM                 ((uint32_t)0x00000017U)         /* !< Maximum value. */
/* RTC_HOUR[HOURLOWBCD] Bits */
#define RTC_HOUR_HOURLOWBCD_OFS                  (8)                             /* !< HOURLOWBCD Offset */
#define RTC_HOUR_HOURLOWBCD_MASK                 ((uint32_t)0x00000F00U)         /* !< Hours BCD  low digit (0 to 9). If
                                                                                    RTCBCD=0 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define RTC_HOUR_HOURLOWBCD_MINIMUM              ((uint32_t)0x00000000U)         /* !< Minimum value. */
#define RTC_HOUR_HOURLOWBCD_MAXIMUM              ((uint32_t)0x00000900U)         /* !< Maximum value. */
/* RTC_HOUR[HOURHIGHBCD] Bits */
#define RTC_HOUR_HOURHIGHBCD_OFS                 (12)                            /* !< HOURHIGHBCD Offset */
#define RTC_HOUR_HOURHIGHBCD_MASK                ((uint32_t)0x00003000U)         /* !< Hours BCD  high digit (0 to 2). If
                                                                                    RTCBCD=0 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define RTC_HOUR_HOURHIGHBCD_MINIMUM             ((uint32_t)0x00000000U)         /* !< Minimum value. */
#define RTC_HOUR_HOURHIGHBCD_MAXIMUM             ((uint32_t)0x00002000U)         /* !< Maximum value. */

